{
    "nodes": "The total number of unique nodes (e.g., domains, hosts, or pages) in the graph. Each node represents an entity in the web graph.",
    "arcs": "The total number of directed edges (or arcs) in the graph, representing links between nodes.",
    "successoravggap": "The average gap between successive nodes in the adjacency list of the graph. This reflects the ordering and clustering of nodes in the graph.",
    "avglocality": "A measure of the locality of edges in the graph, indicating how closely related the linked nodes are in terms of graph structure.",
    "maxoutdegree": "The highest number of outgoing edges (links) from a single node in the graph. This identifies the most connected node in terms of outlinks.",
    "dangling": "The total number of dangling nodes in the graph, which are nodes (vertices) with zero outgoing edges (arcs).",
    "percdangling": "The percentage of nodes in the graph that are dangling nodes (see above).",
    "avgoutdegree": "The average number of outgoing edges per node. This provides an overview of the graph's overall connectivity.",
    "successoravglogdelta": "The average logarithmic difference between successive node IDs in the adjacency list. This reflects the dispersion of node IDs in the graph structure.",
    "maxindegree": "The highest number of incoming edges (links) to a single node in the graph. It identifies the most referenced or linked-to node.",
    "avgindegree": "The average number of incoming edges per node. This is equal to avgoutdegree in a balanced directed graph.",
    "sccs": "The total number of strongly connected components (SCCs) in the graph. SCCs are subgraphs in which every node is reachable from every other node within the subgraph.",
    "maxsccsize": "The size (number of nodes) of the largest strongly connected component (SCC) in the graph. This indicates the largest cluster of nodes that are mutually reachable.",
    "percmaxscc": "The percentage of nodes in the graph that belong to the largest strongly connected component (SCC). It shows how dominant the largest SCC is in the overall graph.",
    "percminscc": "The percentage of nodes in the graph that belong to the smallest strongly connected components (SCCs) (typically isolated nodes or trivial SCCs). This indicates the prevalence of disconnected or minimally connected components."
}
